+OPTIONS: ^:{}
***** DONE Which are the most important stars for mYSO C?
CLOSED: [2021-05-29 Sat 00:16]
:PROPERTIES:
:ID:       903F97D6-AF67-4C78-8011-C7DDD449B546
:END:
| Name    | SSN | MPG | Sp. Type    | T_eff, kK |           V |    BC |   M_bol | L/Lsun | R/Rsun | log q_0 |     Q_0 | d (") |   F_bol | L_glob/L_sun | Q_0(glob) |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
| W 1     |   7 | 435 | O4If+O5-6   |       43 |        12.6 | -3.98 | -10.63 |  1.4e6 |  21.29 |  24.46 | 8.0e49 | 11.56 |   3.72 |      2.6e3 |   1.5e47 |
| W 2     | 14* | 470 | O8.5 III    |       36 |        14.1 | -3.45 |  -8.60 |  2.1e5 |  11.76 |  24.04 | 9.2e48 |  3.04 |   8.06 |      5.7e3 |   2.5e47 |
| W 3     |   9 | 355 | O2 III(f)   |     52.5 |       13.45 | -4.58 | -10.38 |  1.1e6 |  12.66 |   24.9 | 7.7e49 | 22.68 |   0.76 |      5.3e2 |   3.7e46 |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
| SSN 168 | 168 |     | B0?         |       30 |    16.7 - 1 | -2.90 |  -6.45 |  3.0e4 |   6.40 |   23.2 | 4.0e47 |   0.2 | 266.05 |          0 |        0 |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
| Sk 80   |   5 | 789 | O7 Iaf+     |       36 |       12.31 | -3.45 | -10.39 |  1.1e6 |  26.92 |  24.07 | 5.2e49 | 122.4 |   0.03 |      1.8e1 |   8.7e44 |
| HD 5980 |     | 755 | WR+WR+O     |       43 | 11.6 + 0.75 | -3.98 | -10.88 |  1.8e6 |  24.14 |      X |   1e50 | 105.7 |   0.06 |      4.0e1 |   2.2e45 |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
| W 4     |  11 | 342 | O5-6 V((f)) |       43 |        13.6 | -3.98 |  -9.63 |  5.5e5 |  13.34 |  24.47 | 3.2e49 | 24.85 |   0.32 |      2.2e2 |   1.3e46 |
| SSN 13  |  13 | 324 | O4 V((f+))  |       48 |       14.13 | -4.31 |  -9.43 |  4.6e5 |   9.79 |   24.8 | 3.7e49 | 36.99 |   0.12 |      8.4e1 |   6.8e45 |
| SSN 15  |  15 | 368 | O6: V((f))  |     42.5 |        14.1 | -3.95 |  -9.10 |  3.4e5 |  10.74 |   24.4 | 1.8e49 | 17.15 |   0.41 |      2.9e2 |   1.5e46 |
| SSN 17  |  17 | 396 | O7V         |       38 |      14.383 | -3.61 |  -8.48 |  1.9e5 |  10.04 |  24.15 | 8.7e48 | 11.53 |   0.51 |      3.6e2 |   1.6e46 |
| SSN 18  |  18 | 487 | O8V         |       36 |       14.47 | -3.45 |  -8.23 |  1.5e5 |   9.94 |  23.94 | 5.2e48 |  8.37 |   0.76 |      5.4e2 |   1.9e46 |
| SSN 46  |  46 | 500 | O6V:        |     42.5 |      15.267 | -3.95 |  -7.93 |  1.2e5 |   6.38 |   24.4 | 6.2e48 | 16.39 |   0.16 |      1.1e2 |   5.8e45 |
| SSN 22  |  22 | 476 | O7?V?       |       38 |      14.562 | -3.61 |  -8.30 |  1.6e5 |   9.22 |  24.15 | 7.3e48 |  4.06 |   3.44 |      2.4e3 |   1.1e47 |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
| SSN 26  |  26 | 655 | OC5-6Vz     |       43 |       14.90 | -3.98 |  -8.33 |  1.7e5 |   7.42 |  24.47 | 9.9e48 |    60 |   0.02 |      1.2e1 |   6.9e44 |
| SSN 37  |  37 | 593 | O5.5V       |       43 |       15.07 | -3.98 |  -8.16 |  1.4e5 |   6.73 |  24.47 | 8.1e48 |    40 |   0.03 |      2.2e1 |   1.3e45 |
|---------+-----+-----+-------------+----------+-------------+-------+--------+--------+--------+--------+--------+-------+--------+------------+----------|
|         |     |     |             |          |             |     X |      X |  7.6e6 |      X |      X | 4.3e50 |     X |      X |      1.3e4 |   6.3e47 |
#+TBLFM: $7=-6.9 log10(1000 $5) + 27.99 ; f2::$8=$6 + $7 - 0.3 - 18.95;f2::$9=10**(-0.4 ($8 - 4.73));s2::$10=sqrt($9 $lsun / 4 $pi $sigma (1000 $5)**4) / $rsun ; f2::$12=4 $pi ($10 $rsun)**2 10**($11);s2::$14=$9 $lsun / 4 $pi (0.3 $pc $13)**2 ; f2::$15=$13 > 1 ? $9 (1 / 2 $13)**2 : 0 ;s2::$16=$13 > 1 ? $12 (1 / 2 $13)**2 : 0 ;s2::@7$12=1e50::@17$7..@17$8=X::@17$9=vsum(@I..@IIIII);s2::@17$10..@17$11=X::@17$12=vsum(@I..@IIIII);s2::@17$13..@17$14=X::@17$15..@17$16=vsum(@I..@IIIII);s2

+ M_bol = V + BC - AV - DM
  + DM = 18.95
  + AV = 0.3 approx (assuming E(B-V) = 0.1)
  + I have added an extra 1 mag extinction by hand to SSN 168
+ L/Lsun = 10**(0.4 (M_sun - M_bol))
  + M_sun = 4.73
+ R = sqrt(L / 4 \pi \sigma T^4)
+ So in terms of bolometric flux, the nearby B star totally dominates
+ But we should work out the external luminosity incident on the globule
  + And not include SSN 168 since that is on the inside
  + Sum over stars of luminosity x area covering fraction: \sum_i L_i \Omega_i / 4\pi
  + \Omega_i / 4\pi = A_glob / 4\pi d^2 = \pi r_glob^2 / 4\pi d^2 = r_glob^2 / 4 d^2
  + Take r_glob = 1 arcsec
+ The result is a total of 1.3e4 Lsun, of which half comes from W 2
+ So this is less than the inner luminosity from SSN 168 (3e4), if that was all trapped
  + Also, the external luminosities are upper limits, assuming that everything is in the plane of the sky
+ I have done the same for the ionizing luminosity
  + I get a total external incident luminosity of Q_ext = 6.3e47 s^-1
  + As opposed to an internal luminosity from the B0V star of 4e47 s^-1
  + The external incident luminosity is split up as follows
    + 40% from W 2
    + 24% from W 1
    + 17% from SSN 22
    + 6% from W 3
    + 13% from the rest (each 3% or less)
+ [ ] Now, we need to compare this with the Ha luminosity of the globule and of the inner sources
***** Luminosities from POWR models
#+begin_src python :tangle "../scripts/powr-parse.py" :results output table
  from pathlib import Path

  datapath = Path("../stars/powr/colors")
  datafiles = datapath.glob("*_colors.txt")

  rslt = [
      ["Grid", "Model", "Q0", "Q1", "Q2", "Q3"],
      None,
  ]

  for datafile in datafiles:
      with open(datafile) as f:
          lines = f.readlines()

      _, grid_id, _, model_id = lines[0].split()
      # print(grid_id, model_id)
      _, _, _, Q0 = lines[6].split()
      _, _, _, Q1 = lines[7].split()
      _, _, _, Q2 = lines[8].split()
      _, _, _, Q3 = lines[9].split()

      rslt.append([grid_id, model_id, Q0, Q1, Q2, Q3])

  print(rslt)
#+end_src

#+RESULTS:
| Grid       | Model |    Q0 |    Q1 |    Q2 |    Q3 |
|------------+-------+-------+-------+-------+-------|
| OB-I       | 54-42 | 50.00 | 49.52 | 45.79 | 48.85 |
| OB-I       | 50-42 | 49.66 | 49.08 | 45.49 | 48.37 |
| SMC-OB-II  | 49-44 | 49.25 | 48.72 | 45.02 | 48.12 |
| SMC-OB-I   | 50-44 | 49.32 | 48.82 | 44.80 | 48.24 |
| SMC-OB-III | 50-42 | 49.59 | 49.05 | 44.63 | 48.34 |
| OB-I       | 53-42 | 49.92 | 49.41 | 45.53 | 48.74 |
| OB-I       | 50-40 | 50.09 | 49.52 | 45.37 | 48.80 |
| SMC-OB-III | 49-42 | 49.52 | 48.96 | 44.68 | 48.24 |
| SMC-OB-II  | 50-44 | 49.33 | 48.82 | 45.28 | 48.23 |
| SMC-OB-I   | 49-44 | 49.24 | 48.73 | 44.36 | 48.14 |
| OB-I       | 49-42 | 49.57 | 48.97 | 44.79 | 48.24 |
| SMC-OB-III | 49-44 | 49.26 | 48.70 | 44.65 | 48.01 |
| SMC-OB-I   | 36-38 | 48.82 | 47.81 | 42.06 | 46.54 |
| SMC-OB-I   | 49-42 | 49.51 | 48.99 | 44.65 | 48.38 |
| SMC-OB-II  | 50-42 | 49.58 | 49.07 | 45.52 | 48.46 |
| SMC-OB-II  | 42-38 | 49.57 | 48.85 | 41.43 | 48.09 |
| SMC-OB-I   | 50-42 | 49.58 | 49.07 | 45.19 | 48.47 |
| SMC-OB-II  | 49-42 | 49.51 | 48.98 | 45.32 | 48.36 |
| OB-I       | 52-42 | 49.81 | 49.34 | 45.93 | 48.72 |
| OB-I       | 56-42 | 50.08 | 49.67 | 46.99 | 49.10 |
| OB-I       | 51-42 | 49.75 | 49.20 | 45.23 | 48.50 |
| SMC-OB-III | 50-44 | 49.33 | 48.79 | 44.75 | 48.10 |
***** Rearrange and rescale the models
:PROPERTIES:
:ID:       262D3FA1-80BD-4225-BE22-7970BD1FF6FF
:END:
+ The Q0' (H0) and Q2' (He+) columns are ionizing luminosities rescaled so that the model has a bolometric luminosity of log L = 5.98, as implied by the cooler Rivero-Gonzalez solution
  + [X] We should also rescale the Mdot values - /now done in the final column/
  + All these models now give Q_0 = 49.80 +/- 0.01
+ The observationally derived Q2 is 45.83 +/- 0.22 ((6.8 +/- 3.4)e45)
  + [2024-04-12 Fri] Updated to slightly higher value
  + [2024-04-14 Sun] Updated to significantly higher value with realistic uncertainties
  + For T = 50,000 K only the strong wind model SMC-OB-II (strong wind) 50-42 model is consistent with the observed Q2 value
    + log Mdot = -5.66=> Mdot = 2e-6
    + The weak wind model has 10x too small a value of Q2, and intermediate wind model has 2.5x too small a value
  + The higher gravity model (50-44) is similiar in that only the stronger wind model works
    + log Mdot = -5.66 => Mdot = 2e-6
  + The lower temperature model (49-42) only marginally consistent with observed Q2 for the strongest wind (SMC-OB-II: Q2 = 45.60), which implies Mdot = 2.34e-6
+ In summary, the He++ ionizing luminosity is a strong function of Teff and Mdot, but very weak gravity dependence
  + Acceptable solutions require Mdot >= 2e-6 and tendo to favor  50 kK over 49 kK
  + /Is there any observational constraint on the mass loss rate?/
  + [X] But we need to have error bars on our value for Q2. This is now done. 
| Grid       | Model | log L | V_inf | log M_dot |    Q0 |    Q1 |    Q2 |    Q3 | Q1/Q0 | 1e4 Q2/Q0 | Q3/Q0 |   Q0' |   Q2' | Mdot' |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| OB-I       | 56-42 | 6.230 | 4136 |       -7 | 50.08 | 49.67 | 46.99 | 49.10 | 0.389 |     8.128 | 0.105 | 49.83 | 46.74 | -7.44 |
| OB-I       | 54-42 | 6.150 | 4077 |       -7 | 50.00 | 49.52 | 45.79 | 48.85 | 0.331 |     0.617 | 0.071 | 49.83 | 45.62 | -7.37 |
| OB-I       | 53-42 | 6.070 | 4001 |       -7 | 49.92 | 49.41 | 45.53 | 48.74 | 0.309 |     0.407 | 0.066 | 49.83 | 45.44 | -7.30 |
| OB-I       | 52-42 | 5.980 | 3898 |       -7 | 49.81 | 49.34 | 45.93 | 48.72 | 0.339 |     1.318 | 0.081 | 49.81 | 45.93 | -7.22 |
| OB-I       | 51-42 | 5.910 | 3835 |       -7 | 49.75 | 49.20 | 45.23 | 48.50 | 0.282 |     0.302 | 0.056 | 49.82 |  45.3 | -7.15 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| SMC-OB-II  | 50-44 | 5.520 | 3311 |   -5.891 | 49.33 | 48.82 | 45.28 | 48.23 | 0.309 |     0.891 | 0.079 | 49.79 | 45.74 | -5.66 |
| SMC-OB-I   | 50-44 | 5.520 | 3311 |   -6.891 | 49.32 | 48.82 | 44.80 | 48.24 | 0.316 |     0.302 | 0.083 | 49.78 | 45.26 | -6.66 |
| SMC-OB-III | 50-44 |  5.52 | 3311 |   -7.891 | 49.33 | 48.79 | 44.75 | 48.10 | 0.288 |     0.263 | 0.059 | 49.79 | 45.21 | -7.66 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| SMC-OB-II  | 50-42 | 5.760 | 3020 |   -5.771 | 49.58 | 49.07 | 45.52 | 48.46 | 0.309 |     0.871 | 0.076 |  49.8 | 45.74 | -5.66 |
| OB-I       | 50-42 | 5.830 | 3800 |       -7 | 49.66 | 49.08 | 45.49 | 48.37 | 0.263 |     0.676 | 0.051 | 49.81 | 45.64 | -7.09 |
| SMC-OB-I   | 50-42 |  5.76 | 3020 |   -6.771 | 49.58 | 49.07 | 45.19 | 48.47 | 0.309 |     0.407 | 0.078 |  49.8 | 45.41 | -6.66 |
| SMC-OB-III | 50-42 |  5.76 | 3020 |   -7.771 | 49.59 | 49.05 | 44.63 | 48.34 | 0.288 |     0.110 | 0.056 | 49.81 | 44.85 | -7.66 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| OB-I       | 50-40 | 6.240 | 3578 |       -7 | 50.09 | 49.52 | 45.37 | 48.80 | 0.269 |     0.191 | 0.051 | 49.83 | 45.11 | -7.35 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| SMC-OB-II  | 49-44 | 5.450 | 3234 |   -5.933 | 49.25 | 48.72 | 45.02 | 48.12 | 0.295 |     0.589 | 0.074 | 49.78 | 45.55 | -5.63 |
| SMC-OB-I   | 49-44 | 5.450 | 3234 |   -6.933 | 49.24 | 48.73 | 44.36 | 48.14 | 0.309 |     0.132 | 0.079 | 49.77 | 44.89 | -6.63 |
| SMC-OB-III | 49-44 | 5.450 | 3234 |   -7.933 | 49.26 | 48.70 | 44.65 | 48.01 | 0.275 |     0.245 | 0.056 | 49.79 | 45.18 | -7.63 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| SMC-OB-II  | 49-42 | 5.700 | 2978 |   -5.799 | 49.51 | 48.98 | 45.32 | 48.36 | 0.295 |     0.646 | 0.071 | 49.79 |  45.6 | -5.63 |
| OB-I       | 49-42 | 5.750 | 3695 |       -7 | 49.57 | 48.97 | 44.79 | 48.24 | 0.251 |     0.166 | 0.047 |  49.8 | 45.02 | -7.01 |
| SMC-OB-I   | 49-42 | 5.700 | 2978 |   -6.799 | 49.51 | 48.99 | 44.65 | 48.38 | 0.302 |     0.138 | 0.074 | 49.79 | 44.93 | -6.63 |
| SMC-OB-III | 49-42 | 5.700 | 2978 |   -7.799 | 49.52 | 48.96 | 44.68 | 48.24 | 0.275 |     0.145 | 0.052 |  49.8 | 44.96 | -7.63 |
|------------+-------+-------+------+----------+-------+-------+-------+-------+-------+-----------+-------+-------+-------+-------|
| SMC-OB-I   | 36-38 | 5.260 | 1979 |   -6.993 | 48.82 | 47.81 | 42.06 | 46.54 | 0.098 |     0.002 | 0.005 | 49.54 | 42.78 | -6.23 |
| SMC-OB-II  | 42-38 | 5.800 | 2316 |   -5.687 | 49.57 | 48.85 | 41.43 | 48.09 | 0.191 |   7.24e-5 | 0.033 | 49.75 | 41.61 | -5.43 |
#+TBLFM: $10=10**($7 - $6);f3::$11=10**(4 + $8 - $6);f3::$12=10**($9 - $6);f3::$13=$6 - ($3 - 5.98)::$14=$8 - ($3 - 5.98)::$15=$5 - 0.75 ($3 - 5.98) + 1.5 (log10(2800 / $4));f2
